hikuinc/hiku_stm32_fw/Src/main.c
/**
  ******************************************************************************
  * @file    Src/main.c 
  * @author  Nils Gura
  * @version V1.0
  * @date    21-Sep-2015
  * @brief   Scanner/Microphone software
  */ 

/* Includes ------------------------------------------------------------------*/
#include "zbar.h"
#include "decoder.h"
#include "stm32f0xx_hal.h"
#include "barcode.h"
#include "pdm_filter.h"
#include "scanner_hal.h"
#include "scanner.h"
#include "main.h"

/* Private typedef -----------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Timer handler declaration */
TIM_HandleTypeDef    TimHandleSp;
	
/* UART handler declaration */
UART_HandleTypeDef UartHandle;

/* SPI handler declaration */
SPI_HandleTypeDef SpiHandle;
PDMFilter_InitStruct Filter[DEFAULT_AUDIO_IN_CHANNEL_NBR];
static int16_t RecBuf[PCM_OUT_SIZE*DEFAULT_AUDIO_IN_CHANNEL_NBR];
static uint8_t AudioPacketBuf[PACKET_HDR_LEN + AUDIO_PAYLOAD_LEN];
static uint8_t ScanPacketBuf[PACKET_HDR_LEN + SCAN_PAYLOAD_LEN];

/* ADC handle declaration */
ADC_HandleTypeDef             AdcHandle;

/* Buffer used for reception */
static uint16_t InternalBuffer[INTERNAL_BUFF_SIZE];
/* Buffer used for processing */
static uint16_t InternalBufferCopy[INTERNAL_BUFF_SIZE];

/* Scanner buffers */
// use double-buffering (ping-pong buffering) to have one buffer to process
// for bar codes while the other is being filled from the AD converter
uint8_t  img_buf[2][IMAGE_COLUMNS];
uint32_t img_buf_wr_ptr = 0;

static uint8_t scan_decoded;

const scan_cmd_t scan_commands[] = {{.cmdChar='M', .scanCmd=SCAN_CMD_MIC},
                                    {.cmdChar='N', .scanCmd=SCAN_CMD_MIC_SCAN},
																		{.cmdChar='S', .scanCmd=SCAN_CMD_SCAN},
                                    {.cmdChar='L', .scanCmd=SCAN_CMD_LIGHT_ONLY},
																		{.cmdChar='D', .scanCmd=SCAN_CMD_SCAN_DEBUG},
																		{.cmdChar='E', .scanCmd=SCAN_CMD_FLASH_ERASE}
																	 };

static scan_enum_t scanCmd = SCAN_CMD_NONE;
																	 
/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);

/* Private functions ---------------------------------------------------------*/
	
void UART_Config(scan_enum_t scanCmd) {
		/*##-1- Configure the UART peripheral ######################################*/
  /* Put the USART peripheral in the Asynchronous mode (UART Mode) */
  /* UART configured as follows:
      - Word Length = 8 Bits
      - Stop Bit = One Stop bit
      - Parity = None
      - BaudRate = UART_BAUD_RATE/UART_BAUD_RATE_DEBUG baud
      - Hardware flow control disabled (RTS and CTS signals) */
  UartHandle.Instance        = USARTx;

	if (scanCmd == SCAN_CMD_SCAN_DEBUG)
		UartHandle.Init.BaudRate   = UART_BAUD_RATE_DEBUG;
	else
		UartHandle.Init.BaudRate   = UART_BAUD_RATE;

  UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
  UartHandle.Init.StopBits   = UART_STOPBITS_1;
  UartHandle.Init.Parity     = UART_PARITY_NONE;
  UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
  UartHandle.Init.Mode       = UART_MODE_TX_RX;
  UartHandle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if(HAL_UART_DeInit(&UartHandle) != HAL_OK) Error_Handler();
  if(HAL_UART_Init(&UartHandle) != HAL_OK) Error_Handler();
}

// Send string via UART
void SendString(char* data_string){
	uint32_t char_count=0;	
	while (char_count<255 && data_string[char_count] != 0) char_count++;
	if(HAL_UART_Transmit_DMA(&UartHandle, (uint8_t*) data_string, char_count)!= HAL_OK) Error_Handler();
}

/**
  * @brief  Initialize the PDM library.
  * @param  AudioFreq: Audio sampling frequency
  * @param  ChnlNbr: Number of audio channels (1: mono; 2: stereo)
  * @retval None
  */
static void PDMDecoder_Init(uint32_t AudioFreq, uint32_t ChnlNbr)
{ 
  uint32_t i = 0;
  
  /* Enable CRC peripheral to unlock the PDM library */
  __CRC_CLK_ENABLE();
  
  for(i = 0; i < ChnlNbr; i++)
  {
    /* Filter LP and HP Init */
    Filter[i].LP_HZ = AudioFreq / 2;
    Filter[i].HP_HZ = 10;
    Filter[i].Fs = AudioFreq;
    Filter[i].Out_MicChannels = 1;
    Filter[i].In_MicChannels = ChnlNbr; 
    PDM_Filter_Init((PDMFilter_InitStruct *)&Filter[i]);
  }  
}

int8_t ALaw_Encode(int16_t number)
{
   const uint16_t ALAW_MAX = 0xFFF;
   uint16_t mask = 0x800;
   uint8_t sign = 0;
   uint8_t position = 11;
   uint8_t lsb = 0;
   if (number < 0)
   {
      number = -number;
      sign = 0x80;
   }
   if (number > ALAW_MAX)
   {
      number = ALAW_MAX;
   }
   for (; ((number & mask) != mask && position >= 5); mask >>= 1, position--);
   lsb = (number >> ((position == 4) ? (1) : (position - 4))) & 0x0f;
   return (sign | ((position - 4) << 4) | lsb) ^ 0x55;
}

static void symbol_handler (zbar_decoder_t *dcode)
{
	  static uint8_t scan_wr_ptr = 0;
	  static uint8_t decode_count = 0;
	  static char decode_buffer[DECODE_BUFFER_SIZE][DECODE_BUFFERS];

    uint32_t i, j;
	  uint32_t decodes_equal;
    zbar_symbol_type_t type = zbar_decoder_get_type(dcode);

	  if(type <= ZBAR_PARTIAL)
      return;
		
    const char *data = zbar_decoder_get_data(dcode);
    unsigned datalen = zbar_decoder_get_data_length(dcode);
		
		if (datalen > DECODE_BUFFER_SIZE)
			return;

		if (decode_count >= DECODE_BUFFERS/2) {
			decodes_equal = 0;
			for (i=0; i<decode_count; i++) {
				for (j=0; j<datalen; j++) 
			     if (data[j] != decode_buffer[j][i])
							break;
				if (j == datalen)
					decodes_equal++;
				if (decodes_equal == DECODE_BUFFERS/2) {
		      ScanPacketBuf[PACKET_LEN_FIELD] = 0;
		      ScanPacketBuf[PACKET_LEN_FIELD+1] = datalen+3;
					for (j=0; j<datalen; j++)
					  ScanPacketBuf[PACKET_HDR_LEN + j] = data[j];
		      ScanPacketBuf[PACKET_HDR_LEN + j] = '\r';
		      ScanPacketBuf[PACKET_HDR_LEN + j+1] = '\n';
		      ScanPacketBuf[PACKET_HDR_LEN + j+2] = 0;
					scan_decoded = 1;
					//scan result is sent in the main loop
					return;
				}
		  }
		}

    for (i=0; i<datalen; i++) 
      decode_buffer[i][scan_wr_ptr] = data[i];
		scan_wr_ptr = (scan_wr_ptr+1) % DECODE_BUFFERS;
		decode_count = (decode_count >= DECODE_BUFFERS) ? DECODE_BUFFERS : (decode_count + 1);
}

/* turn on scanner LED on/off */
void setScannerLED (uint8_t value) {
	  HAL_GPIO_WritePin(SCAN_ON_LED_PORT, SCAN_ON_LED_PIN, value ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

