hikuinc/hiku_stm32_fw/Src/main.c
/* set scanner image sensor gain high/low */
void setScannerGAIN (uint8_t value) {
	HAL_GPIO_WritePin(SCAN_GS_PORT, SCAN_GS_PIN, value ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

void toggleDebug() {
	HAL_GPIO_TogglePin(DEBUG_OUT_PORT, DEBUG_OUT_PIN);
}

// send the software version to the Imp via UART
void sendSWVersion(){
	  uint8_t pkt_buf[9];
	
		pkt_buf[0] = (PACKET_HDR >> 24) & 0xFF;
		pkt_buf[1] = (PACKET_HDR >> 16) & 0xFF;
		pkt_buf[2] = (PACKET_HDR >> 8) & 0xFF;
		pkt_buf[3] = PACKET_HDR & 0xFF;
		pkt_buf[4] = PKT_TYPE_SW_VERSION;
		pkt_buf[5] = 0x00;
		pkt_buf[6] = 0x02;
		pkt_buf[7] = SOFTWARE_VERSION;
		pkt_buf[8] = SOFTWARE_REVISION;
	
	  // use a blocking transmit with a 20ms timeout to transmit the software version
	  if(HAL_UART_Transmit(&UartHandle, pkt_buf, PACKET_HDR_LEN + pkt_buf[PACKET_LEN_FIELD+1], 20)!= HAL_OK) Error_Handler();
}

void Img_Scanner_Configuration(void)
{ 												
  GPIO_InitTypeDef GPIO_InitStruct;
  TIM_HandleTypeDef    TimHandle;
	TIM_MasterConfigTypeDef sMasterConfig;
  TIM_OC_InitTypeDef sConfig;
  ADC_ChannelConfTypeDef        adc_sConfig;
		
  /*
  *  Image sensor chip enable (active low), MT710T SENSOR_PD/pin 8
  */
	SENSOR_PD_CLK_ENABLE();
  GPIO_InitStruct.Pin = SENSOR_PD_PIN;
  GPIO_InitStruct.Mode = SENSOR_PD_MODE;
  GPIO_InitStruct.Pull = SENSOR_PD_PULL;
  GPIO_InitStruct.Speed = SENSOR_PD_SPEED;
  HAL_GPIO_Init(SENSOR_PD_PORT, &GPIO_InitStruct);  
  /* enable image sensor */
  HAL_GPIO_WritePin(SENSOR_PD_PORT, SENSOR_PD_PIN, GPIO_PIN_RESET); 

  /*
  *  Scanner LED enable PA6, MT700 pin 3
  */
	SCAN_ON_LED_CLK_ENABLE();
  GPIO_InitStruct.Pin = SCAN_ON_LED_PIN;
  GPIO_InitStruct.Mode = SCAN_ON_LED_MODE;
  GPIO_InitStruct.Pull = SCAN_ON_LED_PULL;
  GPIO_InitStruct.Speed = SCAN_ON_LED_SPEED;
  HAL_GPIO_Init(SCAN_ON_LED_PORT, &GPIO_InitStruct);  
  /* turn on scanner LED off */
  HAL_GPIO_WritePin(SCAN_ON_LED_PORT, SCAN_ON_LED_PIN, GPIO_PIN_RESET); 
	
  /*
  *  Image gain, MT710T GS/pin 2
  */
	SCAN_GS_CLK_ENABLE();
  GPIO_InitStruct.Pin = SCAN_GS_PIN;
  GPIO_InitStruct.Mode = SCAN_GS_MODE;
  GPIO_InitStruct.Pull = SCAN_GS_PULL;
  GPIO_InitStruct.Speed = SCAN_GS_SPEED;
  HAL_GPIO_Init(SCAN_GS_PORT, &GPIO_InitStruct);  
  /* set high gain */
  HAL_GPIO_WritePin(SCAN_GS_PORT, SCAN_GS_PIN, GPIO_PIN_SET); 

  /*
  *  Scan line start/end, MT710T SYNC/pin 1
  */
	SCAN_SYNC_CLK_ENABLE();
  GPIO_InitStruct.Pin = SCAN_SYNC_PIN;
  GPIO_InitStruct.Mode = SCAN_SYNC_MODE;
  GPIO_InitStruct.Pull = SCAN_SYNC_PULL;
  GPIO_InitStruct.Speed = SCAN_SYNC_SPEED;
  HAL_GPIO_Init(SCAN_SYNC_PORT, &GPIO_InitStruct);  

  /* Enable and set EOS EXTI Interrupt to the second highest priority */
  HAL_NVIC_SetPriority(SCAN_SYNC_EXTI_IRQn, 0x01, 0x00);
  HAL_NVIC_EnableIRQ(SCAN_SYNC_EXTI_IRQn);
  	
  /*
  *  Scanner start pulse signal, MT710T SP/pin 6
  */			 

  TimHandleSp.Instance = SCAN_SP_TIM;
  TimHandleSp.Init.Prescaler         = SCAN_SP_PRESCALER;
  TimHandleSp.Init.Period            = SCAN_SP_PERIOD;
  TimHandleSp.Init.ClockDivision     = 0;
  TimHandleSp.Init.CounterMode       = TIM_COUNTERMODE_UP;
  TimHandleSp.Init.RepetitionCounter = 0;
  if (HAL_TIM_PWM_Init(&TimHandleSp) != HAL_OK) Error_Handler();

  sConfig.OCMode       = TIM_OCMODE_PWM1;
  sConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode   = TIM_OCFAST_DISABLE;
  sConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
  sConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;
  sConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  sConfig.Pulse = SCAN_SP_PULSE;
  if (HAL_TIM_PWM_ConfigChannel(&TimHandleSp, &sConfig, SCAN_SP_TIM_CHANNEL) != HAL_OK) Error_Handler();
	 
  HAL_NVIC_SetPriority(SCAN_SP_IRQn, 0x01, 0x00);
  HAL_NVIC_EnableIRQ(SCAN_SP_IRQn);

  /*
  *  Scanner clock pulse signal, MT710T CP/pin 7
  */
  TimHandle.Instance = SCAN_CP_TIM;
  TimHandle.Init.Prescaler         = SCAN_CP_PRESCALER;
  TimHandle.Init.Period            = SCAN_CP_PERIOD;
  TimHandle.Init.ClockDivision     = 0;
  TimHandle.Init.CounterMode       = TIM_COUNTERMODE_UP;
  TimHandle.Init.RepetitionCounter = 0;
  if (HAL_TIM_PWM_Init(&TimHandle) != HAL_OK) Error_Handler();

  sConfig.OCMode       = TIM_OCMODE_PWM1;
  sConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode   = TIM_OCFAST_DISABLE;
  sConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
  sConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;
  sConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  sConfig.Pulse = SCAN_CP_PULSE;
  if (HAL_TIM_PWM_ConfigChannel(&TimHandle, &sConfig, SCAN_CP_TIM_CHANNEL) != HAL_OK) Error_Handler();
	
	sMasterConfig.MasterOutputTrigger = SCAN_CP_TIM_TRGO;
	sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
	if (HAL_TIMEx_MasterConfigSynchronization(&TimHandle, &sMasterConfig)!= HAL_OK) Error_Handler();
	
	if (HAL_TIM_PWM_Start(&TimHandle, SCAN_CP_TIM_CHANNEL)!= HAL_OK) Error_Handler();

 /*
  *  Debug output pin
  */
	DEBUG_OUT_CLK_ENABLE();
  GPIO_InitStruct.Pin = DEBUG_OUT_PIN;
  GPIO_InitStruct.Mode = DEBUG_OUT_MODE;
  GPIO_InitStruct.Pull = DEBUG_OUT_PULL;
  GPIO_InitStruct.Speed = DEBUG_OUT_SPEED;
  HAL_GPIO_Init(DEBUG_OUT_PORT, &GPIO_InitStruct);  
  HAL_GPIO_WritePin(DEBUG_OUT_PORT, DEBUG_OUT_PIN, GPIO_PIN_RESET); 


  /*
  *  Analog image sensor signal, MT710T CP/pin 7
  */
  AdcHandle.Instance = SCAN_VOUT_ADC;	
  AdcHandle.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
  AdcHandle.Init.LowPowerAutoWait      = DISABLE;
  AdcHandle.Init.LowPowerAutoPowerOff  = DISABLE;
  AdcHandle.Init.Resolution            = ADC_RESOLUTION8b; //ADC_RESOLUTION12b;
  AdcHandle.Init.ScanConvMode          = ADC_SCAN_ENABLE;
  AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
	AdcHandle.Init.ContinuousConvMode    = DISABLE;
  AdcHandle.Init.DiscontinuousConvMode = DISABLE;
	AdcHandle.Init.ExternalTrigConv      = SCAN_VOUT_ADC_TRIG;
	AdcHandle.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_RISING; //ADC_EXTERNALTRIGCONVEDGE_FALLING; 
  AdcHandle.Init.EOCSelection          = EOC_SINGLE_CONV; // convert once per trigger
  AdcHandle.Init.DMAContinuousRequests = DISABLE; 
  AdcHandle.Init.Overrun               = OVR_DATA_OVERWRITTEN;
 
