hikuinc/hiku_stm32_fw/Src/main.c
		// wait for DMA transfer to finish
		while (cmos_sensor_state != CMOS_SENSOR_STOP); 
		// switch between ping-pong buffers
		img_buf_wr_ptr ^= 1;				
		// alternate high gain and low gain scans
		setScannerGAIN(scans%2 == 0);
		cmos_sensor_state = CMOS_SENSOR_READY;
		if (scanCmd == SCAN_CMD_SCAN_DEBUG) {
			if (scans % 4 == 2)
				if(HAL_UART_Transmit_DMA(&UartHandle, AudioPacketBuf, PACKET_HDR_LEN)!= HAL_OK) Error_Handler();
			if ((scan_lines < DEBUG_SCAN_LINES) && scans && ((scan_lines < DEBUG_SCAN_LINES/2) ? (scans % 4 == 0) : (scans % 4 == 3)) ) {
					if(HAL_UART_Transmit_DMA(&UartHandle, img_buf[img_buf_wr_ptr^1], IMAGE_COLUMNS) != HAL_OK) Error_Handler();
					scan_lines++;
				}
		}
		scans++;
						
		// Process the full image array, calling symbol_handler when a barcode is detected
		zbar_scan_y_new(scanner, img_buf[img_buf_wr_ptr^1], IMAGE_COLUMNS);
		// Process unfinished edges and start a new scan
		zbar_scanner_new_scan(scanner);			
	}
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 48000000
  *            HCLK(Hz)                       = 48000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            HSE Frequency(Hz)              = 8000000
  *            PREDIV                         = 1
  *            PLLMUL                         = 6
  *            Flash Latency(WS)              = 1
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

  /* Enable HSE Oscillator and Activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PREDIV = RCC_PREDIV_DIV1;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL6;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct)!= HAL_OK)
  {
    Error_Handler();
  }
  
  /* Select PLL as system clock source and configure the HCLK and PCLK1 clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1)!= HAL_OK)
  {
    Error_Handler();
  }
}
/**
  * @brief  Rx Transfer completed callback.
  * @param  hspi: SPI handle
  * @note   This example shows a simple way to report end of DMA TxRx transfer, and 
  *         you can add your own implementation. 
  * @retval None
  */
void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi) // HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
	static uint8_t audio_samp_count = 0;
	static uint8_t discard_samp = 0;
	static uint32_t flashAddress = FLASH_USER_START_ADDR;
	static uint32_t flashReadAddress = FLASH_USER_START_ADDR;

	uint32_t i;
	
	//HAL_GPIO_WritePin(DEBUG_OUT_PORT, DEBUG_OUT_PIN, GPIO_PIN_SET);
	
	  if (!scan_decoded) {
			
			// Copy data from DMA buffer and start recording next sample
			// (could be done better with DMA ping-pong buffering using SPI interrupts)
			for (i=0; i<INTERNAL_BUFF_SIZE; i++)
				InternalBufferCopy[i]=InternalBuffer[i];

		  if(HAL_SPI_Receive_DMA(&SpiHandle, (uint8_t *)InternalBuffer, 2*INTERNAL_BUFF_SIZE) != HAL_OK) Error_Handler();
			

				// Convert 1ms of PDM data to 16-bit PCM data
				// For 16kHz/16-bit PCM with a decimation factor of 64, this corresponds to
				// 16*64bits = 128 bytes read from the SPI interface (at 1MHz SCK)
				// (1MHz SCK -> 15.625kHz actual recording frequency; 1.024MHz -> 16kHz)			
				PDM_Filter_64_LSB((uint8_t*)&InternalBufferCopy[0], (uint16_t*)&(RecBuf[0]), DEFAULT_AUDIO_IN_VOLUME , (PDMFilter_InitStruct *)&Filter[0]);

				// Discard the first samples to allow the microphone's power supply to stabilize
				// and the PDM filter to stabilize
				if (discard_samp < AUDIO_DISCARD_SAMP) {
					discard_samp++;
					return;
				}

				// Down-sample from 16kHz to 8KHz, convert 16-bit PCM to 8-bit a-law
				if ((scanCmd == SCAN_CMD_MIC_SCAN_INSTANT) && (flashAddress < FLASH_USER_END_ADDR)) {
						  for (i=0; i<(PCM_OUT_SIZE*DEFAULT_AUDIO_IN_CHANNEL_NBR)/2; i+=4) {
							  uint32_t samples = ALaw_Encode(RecBuf[2*(i+3)])&0xFF;
							  samples = (samples << 8) | (ALaw_Encode(RecBuf[2*(i+2)])&0xFF);
							  samples = (samples << 8) | (ALaw_Encode(RecBuf[2*(i+1)])&0xFF);
							  samples = (samples << 8) | (ALaw_Encode(RecBuf[2*i])&0xFF);
							  HAL_FLASH_Program(TYPEPROGRAM_WORD, 
																  flashAddress+audio_samp_count*(PCM_OUT_SIZE*DEFAULT_AUDIO_IN_CHANNEL_NBR)/2+i,
																  samples);
						}
				} else
				   for (i=0; i<(PCM_OUT_SIZE*DEFAULT_AUDIO_IN_CHANNEL_NBR)/2; i++)
					   AudioPacketBuf[PACKET_HDR_LEN + audio_samp_count*(PCM_OUT_SIZE*DEFAULT_AUDIO_IN_CHANNEL_NBR)/2 + i] = ALaw_Encode(RecBuf[2*i]);
				
				if ((flashAddress == FLASH_USER_END_ADDR) && (flashReadAddress < FLASH_USER_END_ADDR)) {
					if (audio_samp_count % AUDIO_QUEUED_PACKET_SPACING == 0)
						if(HAL_UART_Transmit_DMA(&UartHandle, AudioPacketBuf, PACKET_HDR_LEN)!= HAL_OK) Error_Handler();
					if (audio_samp_count % AUDIO_QUEUED_PACKET_SPACING == 2) {
						if(HAL_UART_Transmit_DMA(&UartHandle,(uint8_t *) flashReadAddress, AUDIO_PAYLOAD_LEN)!= HAL_OK) Error_Handler();
						flashReadAddress += FLASH_PAGE_SIZE;
					}
				}
					
				audio_samp_count++;
			  // send the packet header ahead of time to avoid overwriting of data in AudioPacketBuf
				// if the interrupt routine is called again prior to the data having been transmitted
			  if ((audio_samp_count == AUDIO_SAMP_PER_PACKET-2) &&
					 ((scanCmd != SCAN_CMD_MIC_SCAN_INSTANT) || (flashAddress >= FLASH_USER_END_ADDR)))
				    if(HAL_UART_Transmit_DMA(&UartHandle, AudioPacketBuf, PACKET_HDR_LEN)!= HAL_OK) Error_Handler();
				if (audio_samp_count >= AUDIO_SAMP_PER_PACKET) {
					audio_samp_count = 0;
					if ((scanCmd == SCAN_CMD_MIC_SCAN_INSTANT) && (flashAddress <= FLASH_USER_END_ADDR))
							flashAddress += FLASH_PAGE_SIZE;
					if ((scanCmd != SCAN_CMD_MIC_SCAN_INSTANT) || (flashAddress > FLASH_USER_END_ADDR))
					  if(HAL_UART_Transmit_DMA(&UartHandle, &AudioPacketBuf[PACKET_HDR_LEN], AUDIO_PAYLOAD_LEN)!= HAL_OK) Error_Handler();
		    }
			}
	//HAL_GPIO_WritePin(DEBUG_OUT_PORT, DEBUG_OUT_PIN, GPIO_PIN_RESET);
}

/**
  * @brief  SPI error callbacks.
  * @param  hspi: SPI handle
  * @note   This example shows a simple way to report transfer error, and you can
  *         add your own implementation.
  * @retval None
  */
 void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  while (1);
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/ 
